{
  "phones": [
    {
      "title": "Iphone 8+",
      "description": "iPhone Pro 12 Max оснащен чипом A14 Bionic, которым называют одним из самых мощных. Новый чип использует техпроцесса 5 нм. Apple отмечает, что и новый 6-ядерный процессор, и 4-ядерный графический процессор являются самыми быстрыми из когда-либо существовавших, а производительность iPhone 12 Pro Max стала на 50% выше, чем у любого другого телефона.  Новая модель Pro Max оснащена множеством профессиональных функций и преимущества смартфона выходят далеко за пределы центрального и графического процессора, ведь вместе с процессором обработки сигналов они обеспечивают мощную вычислительную фотографию, невозможную в традиционных камерах.  Потрясающее качество снимков При слабом освещении благодаря лучшей на iPhone системе камер Pro. Оптический зум с диапазоном 5x. Съёмка, монтаж и воспроизведение видео кинематографического качества в стандарте Dolby Vision. Ночной режим для портретов и дополненная реальность нового уровня благодаря сканеру LiDAR.",
      "price": 17500,
      "color": "черный",
      "photo": "https://akket.com/wp-content/uploads/2017/06/Apple-iPhone-8.jpeg",
      "brand": "Apple ",
      "year": "2011-01-22",
      "id": 1
    },
    {
      "title": "Iphone X",
      "description": "Экран Super Retina с разрешением 2436×1125, при диагонали 5,8 дюйма, 458ppi[6]; впервые среди продуктов Apple используется технология OLED. Поддерживается HDR, Dolby Vision и True Tone. Сенсорный модуль дисплея распознает жесты «3D Touch». В верхней части дисплея имеется вырез для фронтальной камеры и прочих сенсоров, по краям от выреза расположена информация из верхней статусной полосы (сигнал сетей связи, уровень заряда). Для быстрой разблокировки и подтверждений Apple Pay и других сервисов применяется новая технология — Face ID — она распознает лицо владельца телефона. Ранее использовавшийся метод авторизации при помощи отпечатка пальца (Touch ID) более не поддерживается, у телефона нет кнопки Home («Домой»). SOC Apple A11 Bionic Neural, в которой использованы разработанные Apple шестиядерный процессор CPU, трёхблочный видеопроцессор GPU, сопроцессор движения и «нейронный движок» Neural Engine. Последний применяется для машинного обучения, например, в технологии Face ID. Основная камера имеет разрешение 12 Мп и использует двойную оптическую стабилизацию. Доступна вспышка TrueTone из 4 светодиодов с повышенной однородностью засветки. Передняя камера TrueDepth имеет 7 Мп, может снимать серии и видео 1080p. Добавлен портретный режим и режим переноса мимики на анимированные эмодзи «Animoji». Заряда аккумулятора смартфона хватает на 2 часа использования больше, чем iPhone 7. Поддерживается беспроводная зарядка Air Power (впоследствии запланированный выпуск AirPower был отменён), используется стандарт Qi. Смартфон доступен в вариантах с 64 ГБ и 256 ГБ флеш-памяти",
      "price": 23500,
      "color": "белый",
      "photo": "https://www.ixbt.com/td/iphone-7-test/iphone-7-test-6.jpg",
      "brand": "Apple",
      "year": "2017-09-17",
      "id": 2
    },
    {
      "title": "Iphone XR",
      "description": "Смартфон оснащен ЖК-дисплеем Liquid Retina HD диагональю 6,1 дюйма, а также новым передовым процессором Apple A12 Bionic.[1] Имеет тыльную камеру 12 Мп с оптической стабилизацией изображения и фронтальную камеру TrueDepth 7 Мп. Обе камеры поддерживают режим «Портрет», функцию портретного освещения, функцию «Глубина» и Smart HDR. Поддерживает Nano-SIM и eSIM на международном уровне.[2]  В настоящее время iPhone XR является самым доступным устройством в линейке устройств Apple iPhone X.  Телефон представлен в шести цветах: жёлтый, белый, коралловый, черный, синий, а также Product Red.[3]  В августе 2019 года компания Apple заявила, что при самостоятельной установке батареи на новые модели iPhone XR, iPhone XS и iPhone XS Max — устройства будут сообщать об ошибке. Таким образом, смена батареи возможна только в авторизованных сервисных центрах Apple.",
      "price": 25000,
      "color": "желтый",
      "photo": "https://superg.ru/wp-content/uploads/2018/09/iPhone-XR-yellow.jpg",
      "brand": "Apple",
      "year": "2018-09-12",
      "id": 3
    },
    {
      "title": "Iphone 11",
      "description": "iPhone 11 — смартфон корпорации Apple, использующий процессор Apple A13 Bionic и операционную систему iOS 13 (на старте продаж), представленный 10 сентября 2019 года вместе с iPhone 11 Pro и iPhone 11 Pro Max. Является преемником iPhone XR.  Предзаказ телефонов начался 18 сентября 2019 года, начало продаж — 20 сентября 2019 года. Применяется двойная основная камера с новыми алгоритмами обработки изображения на основе машинного обучения - Deep Fusion, Smart HDR и Ночной режим[2]. В комплекте с телефоном по-прежнему будет поставляться 5-ваттное устройство для зарядки и кабель Lightning—USB-A для проводного подключения телефонов к ПК[3].  Аппараты предлагаются в шести цветовых решениях: фиолетовый, жёлтый, зелёный, чёрный, белый и красный[4]. Используется микропроцессорный чип Apple A13, содержащий шесть вычислительных ядер ARMv8, четыре ядра видеоускорителя и восемь ядер нейроускорителя. Телефон будет выпускаться в вариантах с 64, 128 или 256 гигабайтами встроенной флеш-памяти. Дисплей аппарата выполнен в технологии LCD IPS и имеет диагональ 6,06 дюйма[2]. Емкость аккумулятора увеличилась по сравнению с iPhone XR на 168 мАч и составляет теперь 3110 мАч.",
      "price": 30000,
      "color": "красный",
      "photo": "https://tehnobzor.ru/wp-content/uploads/2019/09/iphone-11-10.jpg",
      "brand": "Apple",
      "year": "2019-09-10",
      "id": 4
    },
    {
      "title": "Iphone 12",
      "description": "iPhone 12 является базовой моделью[6] 14-го поколения[7], пришедшей на смену смартфону iPhone 11[8]. Представлен 13 октября 2020 года вместе со своим «младшим братом» (уменьшенной версией) iPhone 12 mini и «профессиональными» моделями iPhone 12 Pro и iPhone 12 Pro Max[9][10][6]. Это первое поколение смартфонов от Apple, поддерживающее стандарт сотовой связи 5G[8][10][11][12].  Уменьшенная версия, получившая название «iPhone 12 mini», имеет такой же процессор и такие же камеры, как и базовый iPhone 12, но обладает меньшими габаритами: экраном с диагональю 5,4 дюйма[6] и весом в 133—135 граммов[2]. Все основные характеристики идентичны характеристикам базовой модели, отличаются только диагональ и разрешение экрана, а также ёмкость аккумулятора.",
      "price": 50000,
      "color": "белый",
      "photo": "https://www.ixbt.com/img/n1/news/2021/3/5/EzlcaD9UcAQdaNX_large.jpg",
      "brand": "Apple",
      "year": "2020-09-17",
      "id": 5
    },
    {
      "title": "Galaxy S8",
      "description": "Samsung Galaxy S8 (SM — G950F / SM — G955F) — смартфон восьмого поколения линейки Galaxy S компании Samsung Electronics. Представлен 29 марта 2017 года на Galaxy Unpacked 2017 в Нью-Йорке.  Модель отличается расширенным экраном, отсутствием кнопки «домой» и заменой её, как называет компания, «невидимой кнопкой» (она находится под стеклом, и передаёт тактильные ощущения вибрацией, подобно), сканером радужной оболочки глаза, технологией распознавания лиц, сканером отпечатков пальцев, который перекочевал на заднюю панель рядом с камерой в связи с отсутствием кнопки «домой», пыле- и влагозащитой по стандарту IP68 (следовательно, смартфон может находиться до 30 минут на глубине до 1,5 метра). Технология профессиональных зеркальных камер Dual Pixel 12 МП OIS (F1.7) + 8 МП (F1.7) с АФ. Металл и 3D — стекло, изогнутое с двух сторон (спереди и сзади). Также оснащён новым голосовым интеллектуальным ассистентом Bixby. Также имеется быстрая беспроводная зарядка.",
      "price": 16800,
      "color": "черный",
      "photo": "https://static.eldorado.ru/photos/71/712/480/65/new_71248065_l_1493101662.jpeg/resize/700x525/",
      "brand": "Samsung",
      "year": "2020-09-17",
      "id": 6
    },
    {
      "title": "Galaxy S9",
      "description": "Samsung Galaxy S9 (SM-G960) — смартфон компании Samsung Electronics, представленный 25 февраля 2018 года. Является частью серии Samsung Galaxy S.  Смартфон получил положительные отзывы профильных СМИ. В качестве основного достоинства устройства рецензентами была отмечена основная камера, во многих вариантах использования лучшая на рынке на тот момент. Также положительных отзывов удостоились новые стереодинамики, поддерживающие технологию Dolby Atmos и настроенные AKG, а также дисплей. Рецензенты с разочарованием отмечали, что по внешнему виду и функциональности телефон во многом идентичен предшественнику в серии — Samsung Galaxy S8, однако Galaxy S9 получил высоко оценённое эргономическое улучшение — сканер отпечатков пальцев был перемещён под камеру. Отрицательные отзывы получило время автономной работы устройства, а также некоторые аппаратные и программные новинки, неудачно заимствованные, по мнению обозревателей, от смартфонов Apple",
      "price": 26500,
      "color": "золотистый",
      "photo": "https://smartfonoff.mobi/wp-content/uploads/2017/10/Samsung-Galaxy-S9-1.jpg",
      "brand": "Samsung",
      "year": "2018-08-16",
      "id": 7
    },
    {
      "title": "Galaxy S10",
      "description": "Samsung Galaxy S10 — смартфон компании Samsung Electronics, представленный 20 февраля 2019 года. Являются частью серии Samsung Galaxy S.  Все пять смартфонов выполнены по новой для серии технологии экрана, которая называется Infinity-O. Теперь экран занимает почти всю область, а фронтальная камера размещена в Infinity-O вырезе на экране. В новых аппаратах камеры подверглись улучшениям, вторая камера на Galaxy S10+ создана для размытия заднего фона. Сканер отпечатков пальцев снова изменился — теперь он ультразвуковой и встроен прямо под экран.",
      "price": 35000,
      "color": "белый",
      "photo": "https://superg.ru/wp-content/uploads/2019/02/Samsung-Galaxy-S10-front-panel.jpg",
      "brand": "Samsung",
      "year": "2019-04-18",
      "id": 8
    },
    {
      "title": "Galaxy S20",
      "description": "Samsung Galaxy S20 — смартфон компании Samsung Electronics, представленный 11 февраля 2020 года. Являются частью серии Samsung Galaxy S и первым смартфоном данной серии, который не имеет в названии порядкового номера, как в случае с предыдущими устройствами. На момент 19 апреля 2020 он стоит примерно 73 тысячи рублей.  Линейка S20 состоит из флагманских моделей Galaxy S20 и Galaxy S20+, отличающихся главным образом размером экрана, а также моделью с фокусом камеры, Galaxy S20 Ultra. Основные улучшения по сравнению с предыдущей моделью, в дополнение к улучшенным спецификациям, включают дисплей с частотой обновления 120 Гц, улучшенную систему камер, поддерживающую запись видео 8K, и зум (англ. zoom) с супер-разрешением 30–100× в зависимости от модели.",
      "price": 47900,
      "color": "черный",
      "photo": "https://wowmoon.ru/wp-content/uploads/2020/02/62ff4af53d8c781c35106e07fa238573.jpg",
      "brand": "Samsung",
      "year": "2020-10-22",
      "id": 9
    },
    {
      "title": "Redmi Note8",
      "description": "Redmi Note 8/8T оснащён дисплеем с IPS матрицей, обладающей хорошими углами обзора. Диагональ экрана 6,3 дюйма, соотношение сторон 19,5:9, а разрешение составляет 1080 x 2340 пикселей при плотности 409 ppi. Экран может распознавать до 10 одновременных касаний. Ширина рамок заметно уменьшилась по сравнению с Redmi Note 7 и составляет 2,5 мм, отступ снизу — 5 мм, сверху — 3 мм. Экран теперь занимает целых 91,4 % площади передней панели.",
      "price": 17900,
      "color": "синий",
      "photo": "https://ru-mi.com/blog/wp-content/uploads/2019/08/RN8-4.jpg",
      "brand": "XiaoMi",
      "year": "2018-08-16",
      "id": 10
    },
    {
      "title": "Redmi Note9",
      "description": "Xiaomi Redmi Note 9: Базовый смартфон линейки Note 9, в России был представлен после Note 9 Pro, Note 9S. Имел в списке своих характеристик процессор MediaTek Helio G85 8x core, 3 или 4 гигабайта оперативной памяти и 64, 128 гигабайт внутренней памяти. Экран IPS, 2340x1080, 6,53\" DotDisplay. основная камера на 48 мегапикселей, также Российская версия смартфона имела модуль NFC.",
      "price": 21000,
      "color": "белый",
      "photo": "https://bredmozga.ru/wp-content/uploads/2019/7460275.jpg",
      "brand": "XiaoMi",
      "year": "2019-07-18",
      "id": 11
    },
    {
      "title": "Redmi Note 10",
      "description": "За производительность Redmi Note 10 отвечает чип Snapdragon 678 — среднеуровневый 4G-процессор. Среди других особенностей есть основная камера с разрешением 48 Мп, аккумулятор емкостью 5000 мАч и быстрая зарядка на 33 Вт. Блок питания будет содержаться в коробке со смартфоном.",
      "price": 49000,
      "color": "синий",
      "photo": "https://wiki-smart.ru/wp-content/uploads/2021/05/xiaomi-redmi-note-10-1-1.jpg",
      "brand": "XiaoMi",
      "year": "2020-08-06",
      "id": 12
    }
  ]
}